nevinxu/HM502B2/platform/CMSIS/Include/device/MKL27Z4/MKL27Z4_spi.h
#define HW_SPI_DL(x)             (*(__IO hw_spi_dl_t *) HW_SPI_DL_ADDR(x))
#define HW_SPI_DL_RD(x)          (HW_SPI_DL(x).U)
#define HW_SPI_DL_WR(x, v)       (HW_SPI_DL(x).U = (v))
#define HW_SPI_DL_SET(x, v)      (BME_OR8(HW_SPI_DL_ADDR(x), (uint8_t)(v)))
#define HW_SPI_DL_CLR(x, v)      (BME_AND8(HW_SPI_DL_ADDR(x), (uint8_t)(~(v))))
#define HW_SPI_DL_TOG(x, v)      (BME_XOR8(HW_SPI_DL_ADDR(x), (uint8_t)(v)))
/*@}*/

/*
 * Constants & macros for individual SPI_DL bitfields
 */

/*!
 * @name Register SPI_DL, field Bits[7:0] (RW)
 */
/*@{*/
#define BP_SPI_DL_Bits       (0U)          /*!< Bit position for SPI_DL_Bits. */
#define BM_SPI_DL_Bits       (0xFFU)       /*!< Bit mask for SPI_DL_Bits. */
#define BS_SPI_DL_Bits       (8U)          /*!< Bit field size in bits for SPI_DL_Bits. */

/*! @brief Read current value of the SPI_DL_Bits field. */
#define BR_SPI_DL_Bits(x)    (HW_SPI_DL(x).U)

/*! @brief Format value for bitfield SPI_DL_Bits. */
#define BF_SPI_DL_Bits(v)    ((uint8_t)((uint8_t)(v) << BP_SPI_DL_Bits) & BM_SPI_DL_Bits)

/*! @brief Set the Bits field to a new value. */
#define BW_SPI_DL_Bits(x, v) (HW_SPI_DL_WR(x, v))
/*@}*/

/*******************************************************************************
 * HW_SPI_DH - SPI data register high
 ******************************************************************************/

/*!
 * @brief HW_SPI_DH - SPI data register high (RW)
 *
 * Reset value: 0x00U
 *
 * Refer to the description of the DL register.
 */
typedef union _hw_spi_dh
{
    uint8_t U;
    struct _hw_spi_dh_bitfields
    {
        uint8_t Bits : 8;              /*!< [7:0] Data (high byte) */
    } B;
} hw_spi_dh_t;

/*!
 * @name Constants and macros for entire SPI_DH register
 */
/*@{*/
#define HW_SPI_DH_ADDR(x)        ((x) + 0x7U)

#define HW_SPI_DH(x)             (*(__IO hw_spi_dh_t *) HW_SPI_DH_ADDR(x))
#define HW_SPI_DH_RD(x)          (HW_SPI_DH(x).U)
#define HW_SPI_DH_WR(x, v)       (HW_SPI_DH(x).U = (v))
#define HW_SPI_DH_SET(x, v)      (BME_OR8(HW_SPI_DH_ADDR(x), (uint8_t)(v)))
#define HW_SPI_DH_CLR(x, v)      (BME_AND8(HW_SPI_DH_ADDR(x), (uint8_t)(~(v))))
#define HW_SPI_DH_TOG(x, v)      (BME_XOR8(HW_SPI_DH_ADDR(x), (uint8_t)(v)))
/*@}*/

/*
 * Constants & macros for individual SPI_DH bitfields
 */

/*!
 * @name Register SPI_DH, field Bits[7:0] (RW)
 */
/*@{*/
#define BP_SPI_DH_Bits       (0U)          /*!< Bit position for SPI_DH_Bits. */
#define BM_SPI_DH_Bits       (0xFFU)       /*!< Bit mask for SPI_DH_Bits. */
#define BS_SPI_DH_Bits       (8U)          /*!< Bit field size in bits for SPI_DH_Bits. */

/*! @brief Read current value of the SPI_DH_Bits field. */
#define BR_SPI_DH_Bits(x)    (HW_SPI_DH(x).U)

/*! @brief Format value for bitfield SPI_DH_Bits. */
#define BF_SPI_DH_Bits(v)    ((uint8_t)((uint8_t)(v) << BP_SPI_DH_Bits) & BM_SPI_DH_Bits)

/*! @brief Set the Bits field to a new value. */
#define BW_SPI_DH_Bits(x, v) (HW_SPI_DH_WR(x, v))
/*@}*/

/*******************************************************************************
 * HW_SPI_CI - SPI clear interrupt register
 ******************************************************************************/

/*!
 * @brief HW_SPI_CI - SPI clear interrupt register (RW)
 *
 * Reset value: 0x00U
 *
 * This register applies only for an instance of the SPI module that supports
 * the FIFO feature. The register has four bits dedicated to clearing the
 * interrupts. Writing 1 to these bits clears the corresponding interrupts if the INTCLR
 * bit in the C3 register is 1. Reading these bits always returns 0. This register
 * also has two read-only bits to indicate the transmit FIFO and receive FIFO
 * overrun conditions. When the receive FIFO is full and data is received, RXFOF is
 * set. Similarily, when the transmit FIFO is full and a write to the data
 * register occurs, TXFOF is set. These flags are cleared when the CI register is read
 * while the flags are set. The register has two more read-only bits to indicate
 * the error flags. These flags are set when, due to some spurious reason,
 * entries in the FIFO total more than 64 bits of data. At this point, all the flags
 * in the status register are reset, and entries in the FIFO are flushed with the
 * corresponding error flags set. These flags are cleared when the CI register is
 * read while the flags are set.
 */
typedef union _hw_spi_ci
{
    uint8_t U;
    struct _hw_spi_ci_bitfields
    {
        uint8_t SPRFCI : 1;            /*!< [0] Receive FIFO full flag clear interrupt */
        uint8_t SPTEFCI : 1;           /*!< [1] Transmit FIFO empty flag clear
                                        * interrupt */
        uint8_t RNFULLFCI : 1;         /*!< [2] Receive FIFO nearly full flag clear
                                        * interrupt */
        uint8_t TNEAREFCI : 1;         /*!< [3] Transmit FIFO nearly empty flag clear
                                        * interrupt */
        uint8_t RXFOF : 1;             /*!< [4] Receive FIFO overflow flag */
        uint8_t TXFOF : 1;             /*!< [5] Transmit FIFO overflow flag */
        uint8_t RXFERR : 1;            /*!< [6] Receive FIFO error flag */
        uint8_t TXFERR : 1;            /*!< [7] Transmit FIFO error flag */
    } B;
} hw_spi_ci_t;

/*!
 * @name Constants and macros for entire SPI_CI register
 */
/*@{*/
#define HW_SPI_CI_ADDR(x)        ((x) + 0xAU)

#define HW_SPI_CI(x)             (*(__IO hw_spi_ci_t *) HW_SPI_CI_ADDR(x))
#define HW_SPI_CI_RD(x)          (HW_SPI_CI(x).U)
#define HW_SPI_CI_WR(x, v)       (HW_SPI_CI(x).U = (v))
#define HW_SPI_CI_SET(x, v)      (BME_OR8(HW_SPI_CI_ADDR(x), (uint8_t)(v)))
#define HW_SPI_CI_CLR(x, v)      (BME_AND8(HW_SPI_CI_ADDR(x), (uint8_t)(~(v))))
#define HW_SPI_CI_TOG(x, v)      (BME_XOR8(HW_SPI_CI_ADDR(x), (uint8_t)(v)))
/*@}*/

/*
 * Constants & macros for individual SPI_CI bitfields
 */

/*!
 * @name Register SPI_CI, field SPRFCI[0] (WORZ)
 *
 * Writing 1 to this bit clears the SPRF interrupt provided that C3[3] is set.
 */
/*@{*/
#define BP_SPI_CI_SPRFCI     (0U)          /*!< Bit position for SPI_CI_SPRFCI. */
#define BM_SPI_CI_SPRFCI     (0x01U)       /*!< Bit mask for SPI_CI_SPRFCI. */
#define BS_SPI_CI_SPRFCI     (1U)          /*!< Bit field size in bits for SPI_CI_SPRFCI. */

